<script setup>

</script>

<template>
  <Flex column items="center" justify="center" gap="2" class="p-6">
    <h1 class="text-3xl font-semibold">Δοκιμαστικές εξετάσεις για πτυχίο ραδιοερασιτέχνη</h1>
    <h1 class="text-2xl">Όροι εξέτασης</h1>

    <Flex column class="w-2/3 rounded p-4 border border-1" gap="12">
      <ul class="list-disc list-inside space-y-4">
        <li>Από την έναρξη της εξέτασης έχετε στη διάθεσή σας <b class="text-primary">ακριβώς 2 ώρες</b> για την ολοκλήρωση της. Καλείστε να απαντήσετε σε 100 ερωτήματα πολλαπλής επιλογής. Σε περίπτωση που δεν έχει ολοκληρωθεί η εξέταση μέσα σε αυτό το διάστημα, η συγκεκριμένη εξέταση <b class="text-primary">θεωρείται πως έχει λήξει και ακυρώνεται.</b></li>
        <li>Θεωρούνται πως επέτυχαν στις γραπτές εξετάσεις οι υποψήφιοι <b class="text-primary">που απαντούν σε τουλάχιστον 80 από τις 100 ερωτήσεις σωστά</b>. Οι ερωτήσεις για κάθε εξέταση επιλέγονται τυχαία, από τα ερωτηματολόγια του υπουργείου, σε συμμόρφωση με τις οδηγίες του ως προς το πλήθος ερωτήσεων ανά κατηγορία.</li>
        <li>Όσοι κατέχουν πτυχίο τριτοβάθμιας εκπαίδευσης κατεύθυνσης ηλεκτρονικής, ηλεκτρολογίας ή τηλεπικοινωνιών, απαλλάσσονται από την γραπτή εξέταση στο κεφάλαιο Α. Στην περίπτωση αυτή, το ερωτηματολόγιο δεν περιέχει τις αντίστοιχες 50 ερωτήσεις από το κεφάλαιο Α, και θεωρούνται ότι επέτυχαν στις εξετάσεις όσοι υποψήφιοι απάντησαν σωστά τουλάχιστον σε 40 από τις 50 υπόλοιπες ερωτήσεις.</li>
      </ul>

      <ul class="list-disc list-inside space-y-4">
        <li><b class="text-primary">Σε περίπτωση που κλείσετε την καρτέλα ή/και επανεκκινήσετε το browser, η συγκεκριμένη εξέταση αυτόματα θεωρείται άκυρη. </b>Δεν υπάρχει η δυνατότητα μεταφοράς μιας σε εξέλιξη εξέτασης μεταξύ browser/συσκευών.</li>
        <li><b class="text-primary">Προτείνεται να κρατήσετε το αναγνωριστικό της εξέτασης σας</b> για να μπορέσετε σε μεταγενέστερη στιγμή να ανατρέξετε στα αποτελέσματα της. Οι έγκυρες ολοκληρωμένες εξετάσεις διατηρούνται για μελλοντική αναφορά επ' αόριστον.</li>
      </ul>
    </Flex>

    <h1 class="text-2xl font-bold pt-6">Επιλέγοντας να προχωρήσετε στην εξέταση, επιβεβαιώνετε πως έχετε διαβάσει και κατανοήσει τις παραπάνω σημειώσεις.</h1>
    <UFormGroup>
      <Flex row justify="center" gap="12">
        <UButton size="lg" variant="outline">Επιστροφή στην αρχική</UButton>
        <UButton size="lg" variant="outline">Συνέχεια στην εξέταση</UButton>
      </Flex>
    </UFormGroup>
  </Flex>
</template>